; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	image0 - mode
	thermograph2 - mode
	image1 - mode
	thermograph3 - mode
	infrared5 - mode
	spectrograph4 - mode
	Star5 - direction
	Star0 - direction
	GroundStation4 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared5)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star5)
	(supports instrument3 image1)
	(supports instrument3 spectrograph4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star0)
	(supports instrument5 image0)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument6 image1)
	(supports instrument6 thermograph3)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star2)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph4)
	(supports instrument8 infrared5)
	(supports instrument8 image1)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument9 image1)
	(supports instrument9 image0)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star1)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 image1)
	(supports instrument11 thermograph2)
	(supports instrument11 spectrograph4)
	(calibration_target instrument11 Star1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
	(supports instrument12 infrared5)
	(supports instrument12 spectrograph4)
	(calibration_target instrument12 Star1)
	(supports instrument13 thermograph2)
	(supports instrument13 image1)
	(supports instrument13 thermograph3)
	(calibration_target instrument13 GroundStation3)
	(supports instrument14 image1)
	(calibration_target instrument14 GroundStation3)
	(calibration_target instrument14 Star2)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 GroundStation3)
	(pointing satellite5 Star1)
	(have_image Planet6 image0)
	(have_image Phenomenon7 image1)
	(have_image Planet8 spectrograph4)
	(have_image Phenomenon9 infrared5)
	(have_image Planet10 image1)
	(have_image Planet10 thermograph2)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 2 of 10
2. (calibrate satellite4 instrument9 star1)
   added: (calibrated instrument9)
   goals met: 2 of 10
3. (turn_to satellite4 planet6 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 planet6)
   goals met: 2 of 10
4. (take_image satellite4 planet6 instrument9 image0)
   added: (have_image planet6 image0)
   goals met: 3 of 10
5. (turn_to satellite4 phenomenon7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 phenomenon7)
   goals met: 3 of 10
6. (take_image satellite4 phenomenon7 instrument9 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 10
7. (turn_to satellite4 phenomenon11 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon11)
   goals met: 4 of 10
8. (turn_to satellite3 groundstation3 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation3)
   goals met: 4 of 10
9. (take_image satellite4 phenomenon11 instrument9 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 10
10. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 5 of 10
11. (calibrate satellite3 instrument8 groundstation3)
   added: (calibrated instrument8)
   goals met: 5 of 10
12. (turn_to satellite3 phenomenon9 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon9)
   goals met: 5 of 10
13. (take_image satellite3 phenomenon9 instrument8 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 6 of 10
14. (turn_to satellite3 planet8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet8)
   goals met: 6 of 10
15. (take_image satellite3 planet8 instrument8 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 7 of 10
16. (turn_to satellite4 planet10 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet10)
   goals met: 7 of 10
17. (take_image satellite4 planet10 instrument9 image1)
   added: (have_image planet10 image1)
   goals met: 8 of 10
18. (take_image satellite4 planet10 instrument9 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 9 of 10
19. (turn_to satellite5 star1 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 star1)
   goals met: 10 of 10
